// ignore_for_file: non_constant_identifier_names, file_names

Map<String, String> hiraganaMap = {};

Map<String, String> hiragana_baseMap = {
  'あ': 'а',
  'い': 'и',
  'う': 'у',
  'え': 'э',
  'お': 'о',
  'か': 'ка',
  'き': 'ки',
  'く': 'ку',
  'け': 'кэ',
  'こ': 'ко',
  'さ': 'са',
  'し': 'си',
  'す': 'су',
  'せ': 'сэ',
  'そ': 'со',
  'た': 'та',
  'ち': 'ти',
  'つ': 'цу',
  'て': 'тэ',
  'と': 'то',
  'な': 'на',
  'に': 'ни',
  'ぬ': 'ну',
  'ね': 'нэ',
  'の': 'но',
  'は': 'ха',
  'ひ': 'хи',
  'ふ': 'фу',
  'へ': 'хэ',
  'ほ': 'хо',
  'ま': 'ма',
  'み': 'ми',
  'む': 'му',
  'め': 'мэ',
  'も': 'мо',
  'や': 'я',
  'ゆ': 'ю',
  'よ': 'ё',
  'ら': 'ра',
  'り': 'ри',
  'る': 'ру',
  'れ': 'рэ',
  'ろ': 'ро',
  'わ': 'ва',
  'を': 'во',
  'ん': 'н',
};

Map<String, String> hiragana_nigoriMap = {
  // Категория 1: Гэ (げ гэ)
  'げ': 'гэ',
  'ご': 'го',
  'ざ': 'дза',
  'じ': 'дзи',
  'ず': 'дзу',
  'ぜ': 'дзэ',
  'ぞ': 'дзо',
  'べ': 'бэ',
  'ぼ': 'бо',
};

Map<String, String> hiragana_hannigoriMap = {
  // Категория 2: Пэ (ぺ пэ)
  'ぱ': 'па',
  'ぴ': 'пи',
  'ぷ': 'пу',
  'ぺ': 'пэ',
  'ぽ': 'по',
};

Map<String, String> hiragana_yonMap = {
  // Категория 4: Кя (きゃ кя)
  'きゃ': 'кя',
  'きゅ': 'кю',
  'きょ': 'кё',
  'しゃ': 'ся',
  'しゅ': 'сю',
  'しょ': 'сё',
  'ちゃ': 'тя',
  'ちゅ': 'тю',
  'ちょ': 'тё',
};

Map<String, String> hiragana_nigoriyonMap = {
  // Категория 3: Гя (ぎゃ гя)
  'ぎゃ': 'гя',
  'ぎゅ': 'гю',
  'ぎょ': 'гё',
  'じゃ': 'дзя',
  'じゅ': 'дзю',
  'じょ': 'дзё',
  'びゃ': 'бя',
  'びゅ': 'бю',
  'びょ': 'бё',
};
