// ignore_for_file: non_constant_identifier_names, file_names

Map<String, String> katakanaMap = {};

Map<String, String> katakana_baseMap = {
  'ア': 'а',
  'イ': 'и',
  'ウ': 'у',
  'エ': 'э',
  'オ': 'о',
  'カ': 'ка',
  'キ': 'ки',
  'ク': 'ку',
  'ケ': 'кэ',
  'コ': 'ко',
  'サ': 'са',
  'シ': 'си',
  'ス': 'су',
  'セ': 'сэ',
  'ソ': 'со',
  'タ': 'та',
  'チ': 'ти',
  'ツ': 'цу',
  'テ': 'тэ',
  'ト': 'то',
  'ナ': 'на',
  'ニ': 'ни',
  'ヌ': 'ну',
  'ネ': 'нэ',
  'ノ': 'но',
  'ハ': 'ха',
  'ヒ': 'хи',
  'フ': 'фу',
  'ヘ': 'хэ',
  'ホ': 'хо',
  'マ': 'ма',
  'ミ': 'ми',
  'ム': 'му',
  'メ': 'мэ',
  'モ': 'мо',
  'ヤ': 'я',
  'ユ': 'ю',
  'ヨ': 'ё',
  'ラ': 'ра',
  'リ': 'ри',
  'ル': 'ру',
  'レ': 'рэ',
  'ロ': 'ро',
  'ワ': 'ва',
  'ヲ': 'во',
  'ン': 'н',
};

Map<String, String> katakana_nigoriMap = {
  // Категория 1: Гэ (げ гэ)
  'ゲ': 'гэ',
  'ゴ': 'го',
  'ザ': 'дза',
  'ジ': 'дзи',
  'ズ': 'дзу',
  'ゼ': 'дзэ',
  'ゾ': 'дзо',
  'ベ': 'бэ',
  'ボ': 'бо',
};

Map<String, String> katakana_hannigoriMap = {
  // Категория 2: Пэ (ぺ пэ)
  'パ': 'па',
  'ピ': 'пи',
  'プ': 'пу',
  'ペ': 'пэ',
  'ポ': 'по',
};

Map<String, String> katakana_yonMap = {
  // Категория 4: Кя (きゃ кя)
  'キャ': 'кя',
  'キュ': 'кю',
  'キョ': 'кё',
  'シャ': 'ся',
  'シュ': 'сю',
  'ショ': 'сё',
  'チャ': 'тя',
  'チュ': 'тю',
  'チョ': 'тё',
};

Map<String, String> katakana_nigoriyonMap = {
  // Категория 3: Гя (ぎゃ гя)
  'ギャ': 'гя',
  'ギュ': 'гю',
  'ギョ': 'гё',
  'ジャ': 'дзя',
  'ジュ': 'дзю',
  'ジョ': 'дзё',
  'ビャ': 'бя',
  'ビュ': 'бю',
  'ビョ': 'бё',
};
